Project/Toir/src/DataProcessors/НастройкаНаследованияСтрокТабличныхЧастей/НастройкаНаследованияСтрокТабличныхЧастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаНаследованияСтрокТабличныхЧастей</name>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаТабЧасти</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначений</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиДляНастройки</name>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Класс</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусНаследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЗначений</name>
      <type>
        <types>CatalogRef.Классы</types>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/Enums/РежимыЗаполненияАтрибутов/РежимыЗаполненияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыЗаполненияАтрибутов</name>
  <enumValues>
    <name>ОбязательныйДляОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ОбязательныйДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбязательныйДляКласса</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Необязательный</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/ChartsOfCharacteristicTypes/АтрибутыКласса/АтрибутыКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>АтрибутыКласса</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    <types>EnumRef.торо_ВидыДокументаВводНачДанных</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.ОбъектыНоменклатуры</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    <types>CatalogRef.торо_ВидыОценок</types>
    <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
    <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>EnumRef.торо_СтатусыДокументов</types>
    <types>CatalogRef.Валюты</types>
    <types>EnumRef.СтатусыОбъектовНСИ</types>
    <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>EnumRef.ТипыКонтактнойИнформации</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    <types>Boolean</types>
    <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    <types>CatalogRef.Классы</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>EnumRef.торо_ВидыВыходныхДокументов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.Контрагенты</types>
    <types>EnumRef.АмортизационныеГруппы</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.торо_КритерииОценки</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    <types>Date</types>
    <types>CatalogRef.НоменклатураКласса</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>EnumRef.торо_ПредставлениеОРДляПечати</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта</types>
    <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.торо_ВидыПредставленийВРДляПечати</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>CatalogRef.ПараметрыВыработкиОС</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.ВидыКонтактнойИнформации</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидОперации</name>
      <description>Вид операции</description>
      <code>00000000003</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ВыгружатьВТиповыеОР</name>
      <description>Выгружать в типовые ОР</description>
      <code>00000000008</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ДоступныеВидыОпераций</name>
      <description>Доступные виды операций</description>
      <code>00000000007</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>КодГруппы</name>
      <description>Код группы</description>
      <code>00000000009</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОбъектОперации</name>
      <description>Объект операции</description>
      <code>00000000005</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>Производитель</name>
      <description>Производитель</description>
      <code>00000000010</code>
      <type>
        <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      </type>
    </items>
    <items>
      <name>ТехОперации</name>
      <description>Тех. операции</description>
      <code>00000000002</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ТехКарты</name>
      <description>Технологические карты</description>
      <code>00000000004</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ТипТехКарты</name>
      <description>Тип тех. карты</description>
      <code>00000000001</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>УзловаяСтруктура</name>
      <description>Узловая структура</description>
      <code>00000000006</code>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМножественное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МножественноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначений</name>
    <type>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Project/Toir/src/DataProcessors/НастройкаНаследованияСтрокТабличныхЧастей/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Класс", Объект.Класс) Тогда
		Элементы.Класс.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТабличнаяЧасть", Объект.ТабличнаяЧасть) Тогда
		Элементы.ТабличнаяЧасть.ТолькоПросмотр = Истина;
		Параметры.Свойство("ИсточникЗначений", Объект.ИсточникЗначений);
		Если ЗначениеЗаполнено(Объект.Класс) И ЗначениеЗаполнено(Объект.ТабличнаяЧасть) Тогда
			ПодготовитьКолонкиТабличнойЧасти();
			ВывестиСтрокиДляНастройкиНаследования();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	
	Объект.ТабличнаяЧасть = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ПустаяСсылка");
	Объект.СтрокиДляНастройки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Класс) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбран класс.'"), , , "Объект.Класс");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура("Класс, ТекущаяСтрока", Объект.Класс, Объект.ТабличнаяЧасть);
	ОткрытьФорму("Обработка.НастройкаНаследованияСтрокТабличныхЧастей.Форма.ФормаВыбораТабЧасти", 
		ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		ПодготовитьКолонкиТабличнойЧасти();
		ВывестиСтрокиДляНастройкиНаследования();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСтрокиДляНастройки

&НаКлиенте
Процедура СтрокиДляНастройкиВыбраноПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	НайденоОтметки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Выбрано", Истина));
	Если НайденоОтметки.Количество() > 0 Тогда
		Для Каждого СтрокаНайдено ИЗ НайденоОтметки Цикл
			Если НЕ СтрокаНайдено.Строка = ТекСтрока.Строка Тогда
				СтрокаНайдено.Выбрано = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекСтрока.Выбрано Тогда
		СтрокиДляОтметки = Новый Массив;
		СтрокиДляОтметки.Добавить(ТекСтрока.Строка);
		
		СтрокиВложеные = Новый Массив;
		
		СтруктураПоискаПодчиненных = Новый Структура("ИсточникЗначений");
		
		Пока СтрокиДляОтметки.Количество() > 0 Цикл 
			
			Для Каждого СтрокаДляОтметки ИЗ СтрокиДляОтметки Цикл
				СтруктураПоискаПодчиненных.ИсточникЗначений = СтрокаДляОтметки;
				НайденоПодчиненные = Объект.СтрокиДляНастройки.НайтиСтроки(СтруктураПоискаПодчиненных);
				Для Каждого СтрокаВложенных ИЗ НайденоПодчиненные Цикл
					СтрокаВложенных.Выбрано = Истина;
					Если НЕ СтрокаВложенных.Строка = СтрокаДляОтметки Тогда
						СтрокиВложеные.Добавить(СтрокаВложенных.Строка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ВремХранилище = СтрокиДляОтметки;
			СтрокиДляОтметки = СтрокиВложеные;
			СтрокиВложеные = ВремХранилище;
			СтрокиВложеные.Очистить();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СделатьНаследником(Команда)
	
	Отказ = Ложь;
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	Если ТекСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Строка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку табличной части, чтобы сделать наследником.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.Класс = Объект.Класс Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку дочернего класса, чтобы сделать наследником.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.СтатусНаследования = 3 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выбранная строка уже является наследником. Сперва разорвите связь с родителем.'"),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Класс, Выбрано", Объект.Класс, Истина));
	Если НайденоСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбрана строка-родитель. Установите флаг у строки-родителя, чтобы сделать строку наследником.'"),,,, 
			Отказ);
	Иначе
		СтрокаРодитель = НайденоСтроки[0];
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура("Строка, Родитель", ТекСтрока.Строка, СтрокаРодитель.Строка);
	ОписаниеОповещения = Новый ОписаниеОповещения("СделатьНаследникомЗавершение", ЭтаФорма, ПараметрыКоманды);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru='Сделать выбранную строку наследником?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РазорватьСвязьСРодителем(Команда)
	
	Отказ = Ложь;
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	Если ТекСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Строка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку табличной части, чтобы разорвать связь с родителем.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.Класс = Объект.Класс Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку дочернего класса, чтобы разорвать связь с родителем.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.СтатусНаследования = 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выбранная строка не является наследником.'"),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РазорватьСвязьЗавершение", ЭтаФорма, ТекСтрока.Строка);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru='Разорвать связь выбранной строки с родителем?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СделатьНаследникомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьНаследникомНаСервере(ДополнительныеПараметры.Строка, ДополнительныеПараметры.Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазорватьСвязьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РазорватьСвязьНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементУправленияВидимостьюСтроки()
	
	ЭлементУправленияВидимостьюСтроки = Неопределено;
	Для Каждого ЭлементУсловногоОформления ИЗ ЭтаФорма.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.Представление = "Не отображать данные строки" Тогда
			ЭлементУправленияВидимостьюСтроки = ЭлементУсловногоОформления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементУправленияВидимостьюСтроки;
	
КонецФункции

&НаСервере
Процедура УдалитьКолонкиАтрибутовТабличнойЧасти()
	
	ЭлементУправленияВидимостьюСтроки = ПолучитьЭлементУправленияВидимостьюСтроки();
	
	МассивУдаляемых = Новый Массив;
	КолВо = КолонкиАтрибутовТабличнойЧасти.Количество();
	Для Н = 1 По КолВо Цикл
		СтрокаКолонка = КолонкиАтрибутовТабличнойЧасти[КолВо - Н];
		Если НЕ ПустаяСтрока(СтрокаКолонка.ИмяКолонки) Тогда
			МассивУдаляемых.Добавить("Объект.СтрокиДляНастройки." + СтрокаКолонка.ИмяКолонки);
			Элементы.Удалить(Элементы[СтрокаКолонка.ИмяПоля]);
			Если НЕ ЭлементУправленияВидимостьюСтроки = Неопределено Тогда
				ПолеДляПроверки = Новый ПолеКомпоновкиДанных(СтрокаКолонка.ИмяПоля);
				КолВоЭлемОформления = ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Количество();
				Для М = 1 По КолВоЭлемОформления Цикл
					ПолеОформления = ЭлементУправленияВидимостьюСтроки.Поля.Элементы[КолВоЭлемОформления - М];
					Если ПолеОформления.Поле = ПолеДляПроверки Тогда
						ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Удалить(ПолеОформления);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		КолонкиАтрибутовТабличнойЧасти.Удалить(СтрокаКолонка);
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивУдаляемых);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиАтрибутовТабличнойЧасти(ТаблицаАтрибутов)
	
	КолонкиТаблицы = ТаблицаАтрибутов.Колонки;
	ЕстьСтатусНаследования  = НЕ (КолонкиТаблицы.Найти("СтатусНаследования") = Неопределено);
	
	ТипСтрока = Тип("Строка");
	
	Н = 1;
	МассивДобавляемых = Новый Массив;
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		ЭтоНенаследуемый = ЕстьСтатусНаследования И СтрокаКолонки.СтатусНаследования > 3;
		ЭтоСтрока = СтрокаКолонки.ТипЗначения.СодержитТип(ТипСтрока);
		Если ЭтоНенаследуемый ИЛИ НЕ ЭтоСтрока И СтрокаКолонки.МножественноеЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ИмяКолонки) Тогда
			ИмяРеквизита = "Атрибут" + Н;
			НовыйРеквизит = Новый РеквизитФормы(
				ИмяРеквизита, СтрокаКолонки.ТипЗначения, "Объект.СтрокиДляНастройки", Строка(СтрокаКолонки.АтрибутКласса));
			МассивДобавляемых.Добавить(НовыйРеквизит);
			СтрокаКолонки.ИмяКолонки = ИмяРеквизита;
		Иначе
			ИмяРеквизита = СтрокаКолонки.ИмяКолонки;
		КонецЕсли;
		
		СтрокаТЧ = КолонкиАтрибутовТабличнойЧасти.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаКолонки);
		СтрокаТЧ.ИмяПоля = "СтрокиДляНастройки" + ИмяРеквизита;
		
		Н = Н + 1;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ЭлементУправленияВидимостьюСтроки = ПолучитьЭлементУправленияВидимостьюСтроки();
	
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		Если ПустаяСтрока(СтрокаКолонки.ИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = "СтрокиДляНастройки" + СтрокаКолонки.ИмяКолонки;
		
		Найдено = Элементы.Найти(ИмяПоля);
		Если Не Найдено = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.СтрокиДляНастройкиГруппаАтрибутыСтроки);
		НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.СтрокиДляНастройки." + СтрокаКолонки.ИмяКолонки;
		НовыйЭлемент.Заголовок   = Строка(СтрокаКолонки.АтрибутКласса);
		НовыйЭлемент.Видимость   = Истина;
		НовыйЭлемент.Ширина      = 14;
		
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		Если СтрокаКолонки.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры Тогда
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "АтрибутПодчиненногоНачалоВыбора");
		
		Если НЕ ЭлементУправленияВидимостьюСтроки = Неопределено Тогда
			ОформляемоеПоле = ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			ОформляемоеПоле.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиТабличнойЧасти()
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Объект.ИсточникЗначений);
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовТабличнойЧасти();
	ПодготовитьКолонкиАтрибутовТабличнойЧасти(ТаблицаАтрибутов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиДляНастройкиНаследования()
	
	// Список объектов, для которых возможна настройка наследования.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Класс);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Классы.Ссылка
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И НЕ Классы.ПометкаУдаления";
	МассивКлассов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ПараметрСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(МассивКлассов);
	
	//гкс+ [TOIR-1/00000041] Однодворцев И. - оптимизация интерфейса.
	ДанныеТабличнойЧасти = Новый Массив;
	ДанныеТабличнойЧасти.Добавить(Объект.ТабличнаяЧасть);
	//гкс-
	
	Объект.СтрокиДляНастройки.Очистить();
	
	// Чтение строк табличных атрибутов.
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		ПараметрСписокРодителей, ДанныеТабличнойЧасти);
	
	Если ТаблицаАтрибутов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	СтрокиТаблицы = Новый Массив;
	
	НовыйИДСтроки = 1;
	
	ПредКласс = Неопределено;
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		Если НЕ ПредКласс = СтрокаТЗ.КлассДляЧтения Тогда
			СтрокаТЧ = Объект.СтрокиДляНастройки.Добавить();
			СтрокаТЧ.Класс = СтрокаТЗ.КлассДляЧтения;
			
			ПредКласс = СтрокаТЗ.КлассДляЧтения;
		КонецЕсли;
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
		
		// Формируем соответствие для быстрого добавления элементов следующего уровня вложенности.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			СтрокиТаблицы.Добавить(ЗначениеПоиска);
		КонецЕсли;
		
		СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
		
		СтрокаТЧ = Объект.СтрокиДляНастройки.Добавить();
		СтрокаТЧ.Класс              = СтрокаТЗ.КлассДляЧтения;
		СтрокаТЧ.Строка             = ЗначениеПоиска;
		СтрокаТЧ.СтатусНаследования = СтрокаТЗ.СтатусНаследования;
		СтрокаТЧ.ИсточникЗначений   = СтрокаТЗ.ИсточникЗначений;
		
		МассивСтрок.Добавить(СтрокаТЧ);
		
		НовыйИДСтроки = НовыйИДСтроки + 1;
		
	КонецЦикла;
	
	// Чтение значений атрибутов строк.
	
	// Таблица родителей для чтения атрибутов строк.
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СтрокиТаблицы);
	
	СтруктураПоискаРодителя = Новый Структура("КлассДляЧтения, Класс");
	СтруктураПоискаКолонок = Новый Структура("АтрибутКласса");
	
	// Вывод значений атрибутов строк.
	ЗначенияАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей);
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.КлассДляЧтения];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		// Подмена объекта назначения в иерархии наследования.
		Если СтрокаЗначений.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ОбъектОперации 
				И ЗначениеЗаполнено(СтрокаЗначений.ЗначениеАтрибутаКласса) Тогда
			//
			СтруктураПоискаРодителя.Класс          = СтрокаЗначений.ЗначениеАтрибутаКласса;
			СтруктураПоискаРодителя.КлассДляЧтения = СтрокаЗначений.КлассДляЧтения;
			Найдено = ПараметрСписокРодителей.НайтиСтроки(СтруктураПоискаРодителя);
			Если Найдено.Количество() > 0 Тогда
				СтрокаЗначений.ЗначениеАтрибутаКласса = СтрокаЗначений.КлассДляЧтения;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураПоискаКолонок.АтрибутКласса = СтрокаЗначений.АтрибутКласса;
		НайденоСтрокаАтрибута = КолонкиАтрибутовТабличнойЧасти.НайтиСтроки(СтруктураПоискаКолонок);
		
		// Добавление значений атрибутов строк в данные обработки.
		Если НайденоСтрокаАтрибута.Количество() > 0 Тогда
			ДанныеКолонкиАтрибута = НайденоСтрокаАтрибута[0];
			Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
				СтрокаТаб[ДанныеКолонкиАтрибута.ИмяКолонки] = СтрокаЗначений.ЗначениеАтрибутаКласса;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СделатьНаследникомНаСервере(Строка, Родитель)
	
	СтрокаОбъект = Строка.ПолучитьОбъект();
	СтрокаОбъект.Родитель = Родитель;
	СтрокаОбъект.Записать();
	
	// Обновление таблицы.
	ВывестиСтрокиДляНастройкиНаследования();
	
	// Отметка родителя.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Родитель));
	Если НайденоСтроки.Количество() > 0 Тогда
		НайденоСтроки[0].Выбрано = Истина;
		
		СтрокиДляОтметки = Новый Массив;
		СтрокиДляОтметки.Добавить(НайденоСтроки[0].Строка);
		
		СтрокиВложеные = Новый Массив;
		
		СтруктураПоискаПодчиненных = Новый Структура("ИсточникЗначений");
		
		Пока СтрокиДляОтметки.Количество() > 0 Цикл 
			
			Для Каждого СтрокаДляОтметки ИЗ СтрокиДляОтметки Цикл
				СтруктураПоискаПодчиненных.ИсточникЗначений = СтрокаДляОтметки;
				НайденоПодчиненные = Объект.СтрокиДляНастройки.НайтиСтроки(СтруктураПоискаПодчиненных);
				Для Каждого СтрокаВложенных ИЗ НайденоПодчиненные Цикл
					СтрокиВложеные.Добавить(СтрокаВложенных.Строка);
					СтрокаВложенных.Выбрано = Истина;
				КонецЦикла;
			КонецЦикла;
			
			ВремХранилище = СтрокиДляОтметки;
			СтрокиДляОтметки = СтрокиВложеные;
			СтрокиВложеные = ВремХранилище;
			СтрокиВложеные.Очистить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Выделение строки-наследника.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Строка));
	Если НайденоСтроки.Количество() > 0 Тогда
		Элементы.СтрокиДляНастройки.ТекущаяСтрока = НайденоСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазорватьСвязьНаСервере(Строка)
	
	СтрокаОбъект = Строка.ПолучитьОбъект();
	СтрокаОбъект.Родитель = Объект.ИсточникЗначений;
	СтрокаОбъект.Записать();
	
	// Обновление таблицы.
	ВывестиСтрокиДляНастройкиНаследования();
	
	// Выделение строки.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Строка));
	Если НайденоСтроки.Количество() > 0 Тогда
		Элементы.СтрокиДляНастройки.ТекущаяСтрока = НайденоСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
